george-hopkins/hcs12mem/target/io_mc9s12ne64.h
/* MMC map 2 of 4 */

#define MTST1 0x0017

/* reserved 0x0018..0x0019 */

/* device id register */

#define PARTIDH 0x001a
#  define PARTIDH_ID15 0x80
#  define PARTIDH_ID14 0x40
#  define PARTIDH_ID13 0x20
#  define PARTIDH_ID12 0x10
#  define PARTIDH_ID11 0x08
#  define PARTIDH_ID10 0x04
#  define PARTIDH_ID9 0x02
#  define PARTIDH_ID8 0x01
#define PARTIDL 0x001b
#  define PARTIDL_ID7 0x80
#  define PARTIDL_ID6 0x40
#  define PARTIDL_ID5 0x20
#  define PARTIDL_ID4 0x10
#  define PARTIDL_ID3 0x08
#  define PARTIDL_ID2 0x04
#  define PARTIDL_ID1 0x02
#  define PARTIDL_ID0 0x01

/* MMC map 3 of 4 */

#define MEMSIZ0 0x001c
#  define MEMSIZ0_REG_SW0 0x80
   /* #  define MEMSIZ0_ 0x40 */
#  define MEMSIZ0_EEP_SW1 0x20
#  define MEMSIZ0_EEP_SW0 0x10
   /* #  define MEMSIZ0_ 0x08 */
#  define MEMSIZ0_RAM_SW2 0x04
#  define MEMSIZ0_RAM_SW1 0x02
#  define MEMSIZ0_RAM_SW0 0x01
#define MEMSIZ1 0x001d
#  define MEMSIZ1_ROM_SW1 0x80
#  define MEMSIZ1_ROM_SW0 0x40
   /* #  define MEMSIZ1_ 0x20 */
   /* #  define MEMSIZ1_ 0x10 */
   /* #  define MEMSIZ1_ 0x08 */
   /* #  define MEMSIZ1_ 0x04 */
#  define MEMSIZ1_PAG_SW1 0x02
#  define MEMSIZ1_PAG_SW0 0x01

/* MEBI map 2 of 3 */

#define IRQCR 0x001e
#  define IRQCR_IRQE 0x80
#  define IRQCR_IRQEN 0x40
   /* #  define IRQCR_ 0x20 */
   /* #  define IRQCR_ 0x10 */
   /* #  define IRQCR_ 0x08 */
   /* #  define IRQCR_ 0x04 */
   /* #  define IRQCR_ 0x02 */
   /* #  define IRQCR_ 0x01 */

/* INT map 2 of 2 */

#define HPRIO  0x001f
#  define HPRIO_PSEL7 0x80
#  define HPRIO_PSEL6 0x40
#  define HPRIO_PSEL5 0x20
#  define HPRIO_PSEL4 0x10
#  define HPRIO_PSEL3 0x08
#  define HPRIO_PSEL2 0x04
#  define HPRIO_PSEL1 0x02
   /* #  define HPRIO_ 0x01 */

/* DBG map 1 of 1 */

#define DBGC1 0x0020
#  define DBGC1_DBGEN 0x80
#  define DBGC1_ARM 0x40
#  define DBGC1_TRGSEL 0x20
#  define DBGC1_BEGIN 0x10
#  define DBGC1_DBGBRK 0x08
   /* #  define DBGC1_ 0x04 */
#  define DBGC1_CAPMOD1 0x02 /* ??? CAPMOD */
#  define DBGC1_CAPMOD0 0x01 /* ??? CAPMOD */
#define DBGSC 0x0021
#  define DBGSC_AF 0x80
#  define DBGSC_BF 0x40
#  define DBGSC_CF 0x20
   /* #  define DBGSC_ 0x10 */
#  define DBGSC_TRG3 0x08 /* ??? TRG */
#  define DBGSC_TRG2 0x04 /* ??? TRG */
#  define DBGSC_TRG1 0x02 /* ??? TRG */
#  define DBGSC_TRG0 0x01 /* ??? TRG */
#define DBGTBH 0x0022
#define DBGTBL 0x0023
#define DBGCNT 0x0024
#  define DBGCNT_TBF 0x80
   /*#  define DBGCNT_ 0x40 */
#  define DBGCNT_CNT5 0x20 /* ??? CNT */
#  define DBGCNT_CNT4 0x10 /* ??? CNT */
#  define DBGCNT_CNT3 0x08 /* ??? CNT */
#  define DBGCNT_CNT2 0x04 /* ??? CNT */
#  define DBGCNT_CNT1 0x02 /* ??? CNT */
#  define DBGCNT_CNT0 0x01 /* ??? CNT */
#define DBGCCX 0x0025
#define DBGCCH 0x0026
#define DBGCCL 0x0027
#define DBGC2 0x0028
#  define DBGC2_BKABEN 0x80
#  define DBGC2_FULL 0x40
#  define DBGC2_BDM 0x20
#  define DBGC2_TAGAB 0x10
#  define DBGC2_BKCEN 0x08
#  define DBGC2_TAGC 0x04
#  define DBGC2_RWCEN 0x02
#  define DBGC2_RWC 0x01
#define DBGC3 0x0029
#  define DBGC3_BKAMBH 0x80
#  define DBGC3_BKAMBL 0x40
#  define DBGC3_BKBMBH 0x20
#  define DBGC3_BKBMBL 0x10
#  define DBGC3_RWAEN 0x08
#  define DBGC3_RWA 0x04
#  define DBGC3_RWBEN 0x02
#  define DBGC3_RWB 0x01
#define DBGCAX 0x002a
#define DBGCAH 0x002b
#define DBGCAL 0x002c
#define DBGCBX 0x002d
#define DBGCBH 0x002e
#define DBGCBL 0x002f

/* MMC map 4 of 4 */

#define PPAGE 0x0030
   /* #  define PPAGE_ 0x80 */
   /* #  define PPAGE_ 0x40 */
#  define PPAGE_PIX5 0x20
#  define PPAGE_PIX4 0x10
#  define PPAGE_PIX3 0x08
#  define PPAGE_PIX2 0x04
#  define PPAGE_PIX1 0x02
#  define PPAGE_PIX0 0x01
/* #define RESERVED_0x0031 0x0031 */

/* MEBI map 3 of 3 */

#define PORTK 0x0032
#  define PORTK_BIT7 0x80
#  define PORTK_BIT6 0x40
#  define PORTK_BIT5 0x20
#  define PORTK_BIT4 0x10
#  define PORTK_BIT3 0x08
#  define PORTK_BIT2 0x04
#  define PORTK_BIT1 0x02
#  define PORTK_BIT0 0x01
#define DDRK  0x0033
#  define DDRK_BIT7 0x80
#  define DDRK_BIT6 0x40
#  define DDRK_BIT5 0x20
#  define DDRK_BIT4 0x10
#  define DDRK_BIT3 0x08
#  define DDRK_BIT2 0x04
#  define DDRK_BIT1 0x02
#  define DDRK_BIT0 0x01
#define SYNR  0x0034
   /* #  define SYNR_ 0x80 */
   /* #  define SYNR_ 0x40 */
#  define SYNR_SYN5 0x20
#  define SYNR_SYN4 0x10
#  define SYNR_SYN3 0x08
#  define SYNR_SYN2 0x04
#  define SYNR_SYN1 0x02
#  define SYNR_SYN0 0x01
#define REFDV 0x0035
   /* #  define REFDV_ 0x80 */
   /* #  define REFDV_ 0x40 */
   /* #  define REFDV_ 0x20 */
   /* #  define REFDV_ 0x10 */
#  define REFDV_REFDV3 0x08
#  define REFDV_REFDV2 0x04
#  define REFDV_REFDV1 0x02
#  define REFDV_REFDV0 0x01
#define CTFLG 0x0036 /* test only */
#define CRGFLG 0x0037
#  define CRGFLG_RTIF   0x80
#  define CRGFLG_PORF   0x40
#  define CRGFLG_LVRF   0x20
#  define CRGFLG_LOCKIF 0x10
#  define CRGFLG_LOCK   0x08
#  define CRGFLG_TRACK  0x04
#  define CRGFLG_SCMIF  0x02
#  define CRGFLG_SCM    0x01
#define CRGINT 0x0038
#  define CRGINT_RTIE 0x80
   /* #  define CRGINT_ 0x40 */
   /* #  define CRGINT_ 0x20 */
#  define CRGINT_LOCKIE 0x10
   /* #  define CRGINT_ 0x08 */
   /* #  define CRGINT_ 0x04 */
#  define CRGINT_SCMIE 0x02
   /* #  define CRGINT_ 0x01 */
#define CLKSEL 0x0039
#  define CLKSEL_PLLSEL 0x80
#  define CLKSEL_PSTP   0x40
#  define CLKSEL_SYSWAI 0x20
#  define CLKSEL_ROAWAI 0x10
#  define CLKSEL_PLLWAI 0x08
#  define CLKSEL_CWAI   0x04
#  define CLKSEL_RTIWAI 0x02
#  define CLKSEL_COPWAI 0x01
#define PLLCTL 0x003a
#  define PLLCTL_CME 0x80
#  define PLLCTL_PLLON 0x40
#  define PLLCTL_AUTO 0x20
#  define PLLCTL_ACQ 0x10
   /* #  define PLLCTL_ 0x08 */
#  define PLLCTL_PRE 0x04
#  define PLLCTL_PCE 0x02
#  define PLLCTL_SCME 0x01
#define RTICTL 0x003b
   /* #  define RTICTL_ 0x80 */
#  define RTICTL_RTR6 0x40
#  define RTICTL_RTR5 0x20
#  define RTICTL_RTR4 0x10
#  define RTICTL_RTR3 0x08
#  define RTICTL_RTR2 0x04
#  define RTICTL_RTR1 0x02
#  define RTICTL_RTR0 0x01
#define COPCTL 0x003c
#  define COPCTL_WCOP 0x80
#  define COPCTL_RSBCK 0x40
   /* #  define COPCTL_ 0x20 */
   /* #  define COPCTL_ 0x10 */
   /* #  define COPCTL_ 0x08 */
#  define COPCTL_CR2 0x04
#  define COPCTL_CR1 0x02
#  define COPCTL_CR0 0x01
#define FORBYP 0x003d /* test only */
#define CTCTL  0x003e /* test only */
#define ARMCOP 0x003f

/* TIM */

#define TIOS 0x0040
#  define TIOS_IOS7 0x80
#  define TIOS_IOS6 0x40
#  define TIOS_IOS5 0x20
#  define TIOS_IOS4 0x10
   /* #  define TIOS_ 0x08 */
   /* #  define TIOS_ 0x04 */
   /* #  define TIOS_ 0x02 */
   /* #  define TIOS_ 0x01 */
#define CFORC 0x0041
#  define CFORC_FOC7 0x80
#  define CFORC_FOC6 0x40
#  define CFORC_FOC5 0x20
#  define CFORC_FOC4 0x10
   /* #  define CFORC_ 0x08 */
   /* #  define CFORC_ 0x04 */
   /* #  define CFORC_ 0x02 */
   /* #  define CFORC_ 0x01 */
#define OC7M 0x0042
#  define OC7M_OC7M7 0x80
#  define OC7M_OC7M6 0x40
#  define OC7M_OC7M5 0x20
#  define OC7M_OC7M4 0x10
   /* #  define OC7M_ 0x08 */
   /* #  define OC7M_ 0x04 */
   /* #  define OC7M_ 0x02 */
   /* #  define OC7M_ 0x01 */
#define OC7D 0x0043
#  define OC7D_OC7D7 0x80
#  define OC7D_OC7D6 0x40
#  define OC7D_OC7D5 0x20
#  define OC7D_OC7D4 0x10
   /* #  define OC7D_ 0x08 */
   /* #  define OC7D_ 0x04 */
   /* #  define OC7D_ 0x02 */
   /* #  define OC7D_ 0x01 */
#define TCNT 0x0044
#define TCNTHI 0x0044
#define TCNTLO 0x0045
#define TSCR1 0x0046
#  define TSCR1_TEN 0x80
#  define TSCR1_TSWAI 0x40
#  define TSCR1_TSFRZ 0x20
#  define TSCR1_TFFCA 0x10
   /* #  define TSCR1_ 0x08 */
   /* #  define TSCR1_ 0x04 */
   /* #  define TSCR1_ 0x02 */
   /* #  define TSCR1_ 0x01 */
#define TTOV 0x0047
#  define TTOV_TOV7 0x80
#  define TTOV_TOV6 0x40
#  define TTOV_TOV5 0x20
#  define TTOV_TOV4 0x10
   /* #  define TTOV_ 0x08 */
   /* #  define TTOV_ 0x04 */
   /* #  define TTOV_ 0x02 */
   /* #  define TTOV_ 0x01 */
#define TCTL1 0x0048
#  define TCTL1_OM7 0x80
#  define TCTL1_OL7 0x40
#  define TCTL1_OM6 0x20
#  define TCTL1_OL6 0x10
#  define TCTL1_OM5 0x08
#  define TCTL1_OL5 0x04
#  define TCTL1_OM4 0x02
#  define TCTL1_OL4 0x01
/* #define RESERVED_0x0049 0x0049 */
#define TCTL3 0x004a
#  define TCTL3_EDG7B 0x80
#  define TCTL3_EDG7A 0x40
#  define TCTL3_EDG6B 0x20
#  define TCTL3_EDG6A 0x10
#  define TCTL3_EDG5B 0x08
#  define TCTL3_EDG5A 0x04
#  define TCTL3_EDG4B 0x02
#  define TCTL3_EDG4A 0x01
/* #define RESERVED_0x004b 0x004b */
#define TIE 0x004c
#  define TIE_C7I 0x80
#  define TIE_C6I 0x40
#  define TIE_C5I 0x20
#  define TIE_C4I 0x10
   /* #  define TIE_ 0x08 */
   /* #  define TIE_ 0x04 */
   /* #  define TIE_ 0x02 */
   /* #  define TIE_ 0x01 */
#define TCSR2 0x004d
#  define TCSR2_TOI 0x80
   /* #  define TCSR2_ 0x40 */
   /* #  define TCSR2_ 0x20 */
   /* #  define TCSR2_ 0x10 */
#  define TCSR2_TCRE 0x08
#  define TCSR2_PR2 0x04
#  define TCSR2_PR1 0x02
#  define TCSR2_PR0 0x01
#define TFLG1 0x004e
#  define TFLG1_C7F 0x80
#  define TFLG1_C6F 0x40
#  define TFLG1_C5F 0x20
#  define TFLG1_C4F 0x10
   /* #  define TFLG1_ 0x08 */
   /* #  define TFLG1_ 0x04 */
   /* #  define TFLG1_ 0x02 */
   /* #  define TFLG1_ 0x01 */
#define TFLG2 0x004f
#  define TFLG2_TOF 0x80
   /* #  define TFLG2_ 0x40 */
   /* #  define TFLG2_ 0x20 */
   /* #  define TFLG2_ 0x10 */
   /* #  define TFLG2_ 0x08 */
   /* #  define TFLG2_ 0x04 */
   /* #  define TFLG2_ 0x02 */
   /* #  define TFLG2_ 0x01 */
/* #define RESERVED_0x0050 0x0050 */
/* #define RESERVED_0x0051 0x0051 */
/* #define RESERVED_0x0052 0x0052 */
/* #define RESERVED_0x0053 0x0053 */
/* #define RESERVED_0x0054 0x0054 */
/* #define RESERVED_0x0055 0x0055 */
/* #define RESERVED_0x0056 0x0056 */
/* #define RESERVED_0x0057 0x0057 */
#define TC4 0x0058
#define TC4HI 0x0058
#define TC4LO 0x0059
#define TC5 0x005a
#define TC5HI 0x005a
#define TC5LO 0x005b
#define TC6 0x005c
#define TC6HI 0x005c
#define TC6LO 0x005d
#define TC7 0x005e
#define TC7HI 0x005e
#define TC7LO 0x005f
#define PACTL 0x0060
   /* #  define PACTL_ 0x80 */
#  define PACTL_PAEN 0x40
#  define PACTL_PAMOD 0x20
#  define PACTL_PEDGE 0x10
#  define PACTL_CLK1 0x08
#  define PACTL_CLK0 0x04
#  define PACTL_PAOVI 0x02
#  define PACTL_PAIF 0x01
#define PAFLG 0x0061
   /* #  define PAFLG_ 0x80 */
   /* #  define PAFLG_ 0x40 */
   /* #  define PAFLG_ 0x20 */
   /* #  define PAFLG_ 0x10 */
   /* #  define PAFLG_ 0x08 */
   /* #  define PAFLG_ 0x04 */
#  define PAFLG_PAOVF 0x02
#  define PAFLG_PAIF 0x01
#define PACNT 0x0062
#define PACNTHI 0x0062
#define PACNTLO 0x0063

/* reserved 0x0064..0x006f */
/* reserved 0x0070..0x007f */

/* ATD0 */

#define ATDCTL0 0x0080
   /* #  define ATDCTL0_ 0x80 */
   /* #  define ATDCTL0_ 0x40 */
   /* #  define ATDCTL0_ 0x20 */
   /* #  define ATDCTL0_ 0x10 */
   /* #  define ATDCTL0_ 0x08 */
#  define ATDCTL0_WRAP2 0x04
#  define ATDCTL0_WRAP1 0x02
#  define ATDCTL0_WRAP0 0x01
#define ATDCTL1 0x0081
#  define ATDCTL1_ETRIG_SEL 0x80
   /* #  define ATDCTL1_ 0x40 */
   /* #  define ATDCTL1_ 0x20 */
   /* #  define ATDCTL1_ 0x10 */
   /* #  define ATDCTL1_ 0x08 */
#  define ATDCTL1_ETRIG_CH2 0x04
#  define ATDCTL1_ETRIG_CH1 0x02
#  define ATDCTL1_ETRIG_CH0 0x01
#define ATDCTL2 0x0082
#  define ATDCTL2_ADPU 0x80
#  define ATDCTL2_AFFC 0x40
#  define ATDCTL2_AWAI 0x20
#  define ATDCTL2_ETRIGLE 0x10
#  define ATDCTL2_ETRIGP 0x08
#  define ATDCTL2_ETRIGE 0x04
#  define ATDCTL2_ASCIE 0x02
#  define ATDCTL2_ASCIF 0x01
#define ATDCTL3 0x0083
   /* #  define ATDCTL3_ 0x80 */
#  define ATDCTL3_S8C 0x40
#  define ATDCTL3_S4C 0x20
#  define ATDCTL3_S2C 0x10
#  define ATDCTL3_S1C 0x08
#  define ATDCTL3_FIFO 0x04
#  define ATDCTL3_FRZ1 0x02
#  define ATDCTL3_FRZ0 0x01
#define ATDCTL4 0x0084
#  define ATDCTL4_SRES8 0x80
#  define ATDCTL4_SMP1 0x40
#  define ATDCTL4_SMP0 0x20
#  define ATDCTL4_PRS4 0x10
#  define ATDCTL4_PRS3 0x08
#  define ATDCTL4_PRS2 0x04
#  define ATDCTL4_PRS1 0x02
#  define ATDCTL4_PRS0 0x01
#define ATDCTL5 0x0085
#  define ATDCTL5_DJM 0x80
#  define ATDCTL5_DSGN 0x40
#  define ATDCTL5_SCAN 0x20
#  define ATDCTL5_MULT 0x10
   /* #  define ATDCTL5_ 0x08 */
#  define ATDCTL5_CC 0x04
#  define ATDCTL5_CB 0x02
#  define ATDCTL5_CA 0x01
#define ATDSTAT0 0x0086
#  define ATDSTAT0_SCF 0x80
   /* #  define ATDSTAT0_ 0x40 */
#  define ATDSTAT0_ETORF 0x20
#  define ATDSTAT0_FIFOR 0x10
   /* #  define ATDSTAT0_ 0x08 */
#  define ATDSTAT0_CC2 0x04
#  define ATDSTAT0_CC1 0x02
#  define ATDSTAT0_CC0 0x01
/* #define RESERVED_0x0087 0x0087 */
#define ATDTEST0 0x0088
#define ATDTEST1 0x0089
#  define ATDTEST1_SC 0x01
/* #define RESERVED_0x008a 0x008a */
#define ATDSTAT1 0x008b
#  define ATDSTAT1_CCF7 0x80
#  define ATDSTAT1_CCF6 0x40
#  define ATDSTAT1_CCF5 0x20
#  define ATDSTAT1_CCF4 0x10
#  define ATDSTAT1_CCF3 0x08
#  define ATDSTAT1_CCF2 0x04
#  define ATDSTAT1_CCF1 0x02
#  define ATDSTAT1_CCF0 0x01
/* #define RESERVED_0x008c 0x008c */
#define ATDDIEN 0x008d
#  define ATDDIEN_IEN7 0x80
#  define ATDDIEN_IEN6 0x40
#  define ATDDIEN_IEN5 0x20
#  define ATDDIEN_IEN4 0x10
#  define ATDDIEN_IEN3 0x08
#  define ATDDIEN_IEN2 0x04
#  define ATDDIEN_IEN1 0x02
#  define ATDDIEN_IEN0 0x01
/* #define RESERVED_0x008e 0x008e */
#define PORTAD0 0x008f
#  define PORTAD0_PTAD7 0x80
#  define PORTAD0_PTAD6 0x40
#  define PORTAD0_PTAD5 0x20
#  define PORTAD0_PTAD4 0x10
#  define PORTAD0_PTAD3 0x08
#  define PORTAD0_PTAD2 0x04
#  define PORTAD0_PTAD1 0x02
#  define PORTAD0_PTAD0 0x01
#define ATDDR0H 0x0090
#define ATDDR0L 0x0091
#define ATDDR1H 0x0092
#define ATDDR1L 0x0093
#define ATDDR2H 0x0094
#define ATDDR2L 0x0095
#define ATDDR3H 0x0096
#define ATDDR3L 0x0097
#define ATDDR4H 0x0098
#define ATDDR4L 0x0099
#define ATDDR5H 0x009a
#define ATDDR5L 0x009b
#define ATDDR6H 0x009c
#define ATDDR6L 0x009d
#define ATDDR7H 0x009e
#define ATDDR7L 0x009f

/* reserved 0x00a0..0x00c7 */

