george-hopkins/hcs12mem/target/io_mc9s12ne64.h
/* SCI0 */

#define SCI0BD  0x00c8
#define SCI0BDH 0x00c8
#  define SCI0BDH_IREN 0x80
#  define SCI0BDH_TNP1 0x40
#  define SCI0BDH_TNP0 0x20
#  define SCI0BDH_SBR12 0x10
#  define SCI0BDH_SBR11 0x08
#  define SCI0BDH_SBR10 0x04
#  define SCI0BDH_SBR9 0x02
#  define SCI0BDH_SBR8 0x01
#define SCI0BDL 0x00c9
#  define SCI0BDL_SBR7 0x80
#  define SCI0BDL_SBR6 0x40
#  define SCI0BDL_SBR5 0x20
#  define SCI0BDL_SBR4 0x10
#  define SCI0BDL_SBR3 0x08
#  define SCI0BDL_SBR2 0x04
#  define SCI0BDL_SBR1 0x02
#  define SCI0BDL_SBR0 0x01
#define SCI0CR1 0x00ca
#  define SCI0CR1_LOOPS 0x80
#  define SCI0CR1_SCISWAI 0x40
#  define SCI0CR1_RSRC 0x20
#  define SCI0CR1_M 0x10
#  define SCI0CR1_WAKE 0x08
#  define SCI0CR1_ILT 0x04
#  define SCI0CR1_PE 0x02
#  define SCI0CR1_PT 0x01
#define SCI0CR2 0x00cb
#  define SCI0CR2_TIE 0x80
#  define SCI0CR2_TCIE 0x40
#  define SCI0CR2_RIE 0x20
#  define SCI0CR2_ILIE 0x10
#  define SCI0CR2_TE 0x08
#  define SCI0CR2_RE 0x04
#  define SCI0CR2_RWU 0x02
#  define SCI0CR2_SBK 0x01
#define SCI0SR1 0x00cc
#  define SCI0SR1_TDRE 0x80
#  define SCI0SR1_TC 0x40
#  define SCI0SR1_RDRF 0x20
#  define SCI0SR1_IDLE 0x10
#  define SCI0SR1_OR 0x08
#  define SCI0SR1_NF 0x04
#  define SCI0SR1_FE 0x02
#  define SCI0SR1_PF 0x01
#define SCI0SR2 0x00cd
   /* #  define SCI0SR2_ 0x80 */
   /* #  define SCI0SR2_ 0x40 */
   /* #  define SCI0SR2_ 0x20 */
   /* #  define SCI0SR2_ 0x10 */
   /* #  define SCI0SR2_ 0x08 */
#  define SCI0SR2_BRK13 0x04
#  define SCI0SR2_TXDIR 0x02
#  define SCI0SR2_RAF 0x01
#define SCI0DRH 0x00ce
#  define SCI0DRH_R8 0x80
#  define SCI0DRH_T8 0x40
   /* #  define SCI0DRH_ 0x20 */
   /* #  define SCI0DRH_ 0x10 */
   /* #  define SCI0DRH_ 0x08 */
   /* #  define SCI0DRH_ 0x04 */
   /* #  define SCI0DRH_ 0x02 */
   /* #  define SCI0DRH_ 0x01 */
#define SCI0DRL 0x00cf
#  define SCI0DRL_R7_T7 0x80
#  define SCI0DRL_R6_T6 0x40
#  define SCI0DRL_R5_T5 0x20
#  define SCI0DRL_R4_T4 0x10
#  define SCI0DRL_R3_T3 0x08
#  define SCI0DRL_R2_T2 0x04
#  define SCI0DRL_R1_T1 0x02
#  define SCI0DRL_R0_T0 0x01

/* SCI1 */

#define SCI1BD  0x00d0
#define SCI1BDH 0x00d0
#  define SCI1BDH_IREN 0x80
#  define SCI1BDH_TNP1 0x40
#  define SCI1BDH_TNP0 0x20
#  define SCI1BDH_SBR12 0x10
#  define SCI1BDH_SBR11 0x08
#  define SCI1BDH_SBR10 0x04
#  define SCI1BDH_SBR9 0x02
#  define SCI1BDH_SBR8 0x01
#define SCI1BDL 0x00d1
#  define SCI1BDL_SBR7 0x80
#  define SCI1BDL_SBR6 0x40
#  define SCI1BDL_SBR5 0x20
#  define SCI1BDL_SBR4 0x10
#  define SCI1BDL_SBR3 0x08
#  define SCI1BDL_SBR2 0x04
#  define SCI1BDL_SBR1 0x02
#  define SCI1BDL_SBR0 0x01
#define SCI1CR1 0x00d2
#  define SCI1CR1_LOOPS 0x80
#  define SCI1CR1_SCISWAI 0x40
#  define SCI1CR1_RSRC 0x20
#  define SCI1CR1_M 0x10
#  define SCI1CR1_WAKE 0x08
#  define SCI1CR1_ILT 0x04
#  define SCI1CR1_PE 0x02
#  define SCI1CR1_PT 0x01
#define SCI1CR2 0x00d3
#  define SCI1CR2_TIE 0x80
#  define SCI1CR2_TCIE 0x40
#  define SCI1CR2_RIE 0x20
#  define SCI1CR2_ILIE 0x10
#  define SCI1CR2_TE 0x08
#  define SCI1CR2_RE 0x04
#  define SCI1CR2_RWU 0x02
#  define SCI1CR2_SBK 0x01
#define SCI1SR1 0x00d4
#  define SCI1SR1_TDRE 0x80
#  define SCI1SR1_TC 0x40
#  define SCI1SR1_RDRF 0x20
#  define SCI1SR1_IDLE 0x10
#  define SCI1SR1_OR 0x08
#  define SCI1SR1_NF 0x04
#  define SCI1SR1_FE 0x02
#  define SCI1SR1_PF 0x01
#define SCI1SR2 0x00d5
   /* #  define SCI1SR2_ 0x80 */
   /* #  define SCI1SR2_ 0x40 */
   /* #  define SCI1SR2_ 0x20 */
   /* #  define SCI1SR2_ 0x10 */
   /* #  define SCI1SR2_ 0x08 */
#  define SCI1SR2_BRK13 0x04
#  define SCI1SR2_TXDIR 0x02
#  define SCI1SR2_RAF 0x01
#define SCI1DRH 0x00d6
#  define SCI1DRH_R8 0x80
#  define SCI1DRH_T8 0x40
   /* #  define SCI1DRH_ 0x20 */
   /* #  define SCI1DRH_ 0x10 */
   /* #  define SCI1DRH_ 0x08 */
   /* #  define SCI1DRH_ 0x04 */
   /* #  define SCI1DRH_ 0x02 */
   /* #  define SCI1DRH_ 0x01 */
#define SCI1DRL 0x00d7
#  define SCI1DRL_R7_T7 0x80
#  define SCI1DRL_R6_T6 0x40
#  define SCI1DRL_R5_T5 0x20
#  define SCI1DRL_R4_T4 0x10
#  define SCI1DRL_R3_T3 0x08
#  define SCI1DRL_R2_T2 0x04
#  define SCI1DRL_R1_T1 0x02
#  define SCI1DRL_R0_T0 0x01

/* SPI */

#define SPICR1 0x00d8
#  define SPICR1_SPIE 0x80
#  define SPICR1_SPE 0x40
#  define SPICR1_SPTIE 0x20
#  define SPICR1_MSTR 0x10
#  define SPICR1_CPOL 0x08
#  define SPICR1_CPHA 0x04
#  define SPICR1_SSOE 0x02
#  define SPICR1_LSBFE 0x01
#define SPICR2 0x00d9
   /* #  define SPICR2_ 0x80 */
   /* #  define SPICR2_ 0x40 */
   /* #  define SPICR2_ 0x20 */
#  define SPICR2_MODFEN 0x10
#  define SPICR2_BIDIROE 0x08
   /* #  define SPICR2_ 0x04 */
#  define SPICR2_SPISWAI 0x02
#  define SPICR2_SPC0 0x01
#define SPIBR 0x00da
   /* #  define SPIBR_ 0x80 */
#  define SPIBR_SPPR2 0x40
#  define SPIBR_SPPR1 0x20
#  define SPIBR_SPPR0 0x10
   /* #  define SPIBR_ 0x08 */
#  define SPIBR_SPR2 0x04
#  define SPIBR_SPR1 0x02
#  define SPIBR_SPR0 0x01
#define SPISR 0x00db
#  define SPISR_SPIF 0x80
   /* #  define SPISR_ 0x40 */
#  define SPISR_SPTEF 0x20
#  define SPISR_MODF 0x10
   /* #  define SPISR_ 0x08 */
   /* #  define SPISR_ 0x04 */
   /* #  define SPISR_ 0x02 */
   /* #  define SPISR_ 0x01 */
/* #define RESERVED_0x00dc 0x00dc */
#define SPIDR 0x00dd
/* #define RESERVED_0x00de 0x00de */
/* #define RESERVED_0x00df 0x00df */

/* IIC */

#define IBAD 0x00e0
#  define IBAD_ADR7 0x80
#  define IBAD_ADR6 0x40
#  define IBAD_ADR5 0x20
#  define IBAD_ADR4 0x10
#  define IBAD_ADR3 0x08
#  define IBAD_ADR2 0x04
#  define IBAD_ADR1 0x02
   /* #  define IBAD_ 0x01 */
#define IBFD 0x00e1
#  define IBFD_IBC7 0x80
#  define IBFD_IBC6 0x40
#  define IBFD_IBC5 0x20
#  define IBFD_IBC4 0x10
#  define IBFD_IBC3 0x08
#  define IBFD_IBC2 0x04
#  define IBFD_IBC1 0x02
#  define IBFD_IBC0 0x01
#define IBCR 0x00e2
#  define IBCR_IBEN 0x80
#  define IBCR_IBIE 0x40
#  define IBCR_MSSL 0x20
#  define IBCR_TXRX 0x10
#  define IBCR_TXAK 0x08
#  define IBCR_RSTA 0x04
   /* #  define IBCR_ 0x02 */
#  define IBCR_IBSWAI 0x01
#define IBSR 0x00e3
#  define IBSR_TCF 0x80
#  define IBSR_IAAS 0x40
#  define IBSR_IBB 0x20
#  define IBSR_IBAL 0x10
   /* #  define IBSR_ 0x08 */
#  define IBSR_SRW 0x04
#  define IBSR_IBIF 0x02
#  define IBSR_RXAK 0x01
#define IBDR 0x00e4
/* #define RESERVED_0x00e5 0x00e5 */
/* #define RESERVED_0x00e6 0x00e6 */
/* #define RESERVED_0x00e7 0x00e7 */

/* reserved 0x00e8..0x00ff */

/* FLASH */

#define FCLKDIV 0x0100
#  define FCLKDIV_FDIVLD 0x80
#  define FCLKDIV_PRDIV8 0x40
#  define FCLKDIV_FDIV5 0x20
#  define FCLKDIV_FDIV4 0x10
#  define FCLKDIV_FDIV3 0x08
#  define FCLKDIV_FDIV2 0x04
#  define FCLKDIV_FDIV1 0x02
#  define FCLKDIV_FDIV0 0x01
#define FSEC 0x0101
#  define FSEC_KEYEN 0x80
#  define FSEC_NV6 0x40
#  define FSEC_NV5 0x20
#  define FSEC_NV4 0x10
#  define FSEC_NV3 0x08
#  define FSEC_NV2 0x04
#  define FSEC_SEC1 0x02
#  define FSEC_SEC0 0x01
/* #define RESERVED_0x0102 0x0102 */
#define FCNFG 0x0103
#  define FCNFG_CBEIE 0x80
#  define FCNFG_CCIE 0x40
#  define FCNFG_KEYACC 0x20
   /* #  define FCNFG_ 0x10 */
   /* #  define FCNFG_ 0x08 */
   /* #  define FCNFG_ 0x04 */
   /* #  define FCNFG_ 0x02 */
   /* #  define FCNFG_ 0x01 */
#define FPROT 0x0104
#  define FPROT_FPOPEN 0x80
#  define FPROT_NV6 0x40
#  define FPROT_FPHDIS 0x20
#  define FPROT_FPHS1 0x10
#  define FPROT_FPHS0 0x08
#  define FPROT_FPLDIS 0x04
#  define FPROT_FPLS1 0x02
#  define FPROT_FPLS0 0x01
#define FSTAT 0x0105
#  define FSTAT_CBEIF 0x80
#  define FSTAT_CCIF 0x40
#  define FSTAT_PVIOL 0x20
#  define FSTAT_ACCERR 0x10
   /* #  define FSTAT_ 0x08 */
#  define FSTAT_BLANK 0x04
   /* #  define FSTAT_ 0x02 */
   /* #  define FSTAT_ 0x01 */
#define FCMD 0x0106
   /* #  define FCMD_ 0x80 */
#  define FCMD_CMDB6 0x40
#  define FCMD_CMDB5 0x20
   /* #  define FCMD_ 0x10 */
   /* #  define FCMD_ 0x08 */
#  define FCMD_CMDB2 0x04
   /* #  define FCMD_ 0x02 */
#  define FCMD_CMDB0 0x01
/* #define RESERVED_0x0107 0x0107 */
#define FADDR 0x0108
#define FADDRHI 0x0108
#define FADDRLO 0x0109
#define FDATA 0x010a
#define FDATAHI 0x010a
#define FDATALO 0x010b
/* #define RESERVED_0x010c 0x010c */
/* #define RESERVED_0x010d 0x010d */
/* #define RESERVED_0x010e 0x010e */
/* #define RESERVED_0x010f 0x010f */

/* reserved 0x0110..0x011f */

