george-hopkins/hcs12mem/target/io_mc9s12ne64.h
/* EPHY */

#define EPHYCTL0 0x0120
#  define EPHYCTL0_EPHYEN 0x80
#  define EPHYCTL0_ANDIS 0x40
#  define EPHYCTL0_DIS100 0x20
#  define EPHYCTL0_DIS10 0x10
#  define EPHYCTL0_LEDEN 0x08
#  define EPHYCTL0_EPHYWAI 0x04
   /* #  define EPHYCTL0_ 0x02 */
#  define EPHYCTL0_EPHYIEN 0x01
#define EPHYCTL1 0x0121
   /* #  define EPHYCTL1_ 0x80 */
   /* #  define EPHYCTL1_ 0x40 */
   /* #  define EPHYCTL1_ 0x20 */
#  define EPHYCTL1_PHYADD4 0x10
#  define EPHYCTL1_PHYADD3 0x08
#  define EPHYCTL1_PHYADD2 0x04
#  define EPHYCTL1_PHYADD1 0x02
#  define EPHYCTL1_PHYADD0 0x01
#define EPHYSR   0x0122
   /* #  define EPHYSR_ 0x80 */
   /* #  define EPHYSR_ 0x40 */
#  define EPHYSR_100DIS 0x20
#  define EPHYSR_10DIS 0x10
   /* #  define EPHYSR_ 0x08 */
   /* #  define EPHYSR_ 0x04 */
   /* #  define EPHYSR_ 0x02 */
#  define EPHYSR_EPHYIF 0x01
#define EPHYTST  0x0123

/* reserved 0x0124..0x013f */

/* EMAC */

#define NETCTL 0x0140
#  define NETCTL_EMACE 0x80
   /* #  define NETCTL_ 0x40 */
   /* #  define NETCTL_ 0x20 */
#  define NETCTL_ESWAI 0x10
#  define NETCTL_EXTPHY 0x08
#  define NETCTL_MLB 0x04
#  define NETCTL_FDX 0x02
   /* #  define NETCTL_ 0x01 */
/* #define RESERVED_0x0141 0x0141 */
/* #define RESERVED_0x0142 0x0142 */
#define RXCTS 0x0143
#  define RXCTS_RXACT 0x80
   /* #  define RXCTS_ 0x40 */
   /* #  define RXCTS_ 0x20 */
#  define RXCTS_RFCE 0x10
   /* #  define RXCTS_ 0x08 */
#  define RXCTS_PROM 0x04
#  define RXCTS_CONMC 0x02
#  define RXCTS_BCREJ 0x01
#define TXCTS 0x0144
#  define TXCTS_TXACT 0x80
   /* #  define TXCTS_ 0x40 */
#  define TXCTS_CSLF 0x20
#  define TXCTS_PTRC 0x10
#  define TXCTS_SSB 0x08
   /* #  define TXCTS_ 0x04 */
#  define TXCTS_TCMD1 0x02
#  define TXCTS_TCMD0 0x01
#  define TXCTS_TCMD_MASK 0x03
#define ETCTL 0x0145
#  define ETCTL_FPET 0x80
   /* #  define ETCTL_ 0x40 */
   /* #  define ETCTL_ 0x20 */
#  define ETCTL_FEMW 0x10
#  define ETCTL_FIPV6 0x08
#  define ETCTL_FARP 0x04
#  define ETCTL_FIPV4 0x02
#  define ETCTL_FIEEE 0x01
#define ETYPE 0x0146
#define ETYPEHI 0x0146
#define ETYPELO 0x0147
#define PTIME 0x0148
#define PTIMEHI 0x0148
#define PTIMELO 0x0149
#define IEVENT 0x014a
#  define IEVENT_RFCIF 0x8000
   /* #  define IEVENT_ 0x4000 */
#  define IEVENT_BREIF 0x2000
#  define IEVENT_RXEIF 0x1000
#  define IEVENT_RXAOIF 0x0800
#  define IEVENT_RXBOIF 0x0400
#  define IEVENT_RXACIF 0x0200
#  define IEVENT_RXBCIF 0x0100
#  define IEVENT_MMCIF 0x0080
   /* #  define IEVENT_ 0x0040 */
#  define IEVENT_LCIF 0x0020
#  define IEVENT_ECIF 0x0010
   /* #  define IEVENT_ 0x0008 */
   /* #  define IEVENT_ 0x0004 */
#  define IEVENT_TXCIF 0x0002
   /* #  define IEVENT_ 0x0001 */
#define IEVENTHI 0x014a
#  define IEVENTHI_RFCIF 0x80
   /* #  define IEVENTHI_ 0x40 */
#  define IEVENTHI_BREIF 0x20
#  define IEVENTHI_RXEIF 0x10
#  define IEVENTHI_RXAOIF 0x08
#  define IEVENTHI_RXBOIF 0x04
#  define IEVENTHI_RXACIF 0x02
#  define IEVENTHI_RXBCIF 0x01
#define IEVENTLO 0x014b
#  define IEVENTLO_MMCIF 0x80
   /* #  define IEVENTLO_ 0x40 */
#  define IEVENTLO_LCIF 0x20
#  define IEVENTLO_ECIF 0x10
   /* #  define IEVENTLO_ 0x08 */
   /* #  define IEVENTLO_ 0x04 */
#  define IEVENTLO_TXCIF 0x02
   /* #  define IEVENTLO_ 0x01 */
#define IMASK 0x014c
#  define IMASK_RFCIE 0x8000
   /* #  define IMASK_ 0x4000 */
#  define IMASK_BREIE 0x2000
#  define IMASK_RXEIE 0x1000
#  define IMASK_RXAOIE 0x0800
#  define IMASK_RXBOIE 0x0400
#  define IMASK_RXACIE 0x0200
#  define IMASK_RXBCIE 0x0100
#  define IMASK_MMCIE 0x0080
   /* #  define IMASK_ 0x0040 */
#  define IMASK_LCIE 0x0020
#  define IMASK_ECIE 0x0010
   /* #  define IMASK_ 0x0008 */
   /* #  define IMASK_ 0x0004 */
#  define IMASK_RXCIE 0x0002
   /* #  define IMASK_ 0x0001 */
#define IMASKHI 0x014c
#  define IMASKHI_RFCIE 0x80
   /* #  define IMASKHI_ 0x40 */
#  define IMASKHI_BREIE 0x20
#  define IMASKHI_RXEIE 0x10
#  define IMASKHI_RXAOIE 0x08
#  define IMASKHI_RXBOIE 0x04
#  define IMASKHI_RXACIE 0x02
#  define IMASKHI_RXBCIE 0x01
#define IMASKLO 0x014d
#  define IMASKLO_MMCIE 0x80
   /* #  define IMASKLO_ 0x40 */
#  define IMASKLO_LCIE 0x20
#  define IMASKLO_ECIE 0x10
   /* #  define IMASKLO_ 0x08 */
   /* #  define IMASKLO_ 0x04 */
#  define IMASKLO_RXCIE 0x02
   /* #  define IMASKLO_ 0x01 */
#define SWRST 0x014e
#  define SWRST_MACRST 0x80
   /* #  define SWRST_ 0x40 */
   /* #  define SWRST_ 0x20 */
   /* #  define SWRST_ 0x10 */
   /* #  define SWRST_ 0x08 */
   /* #  define SWRST_ 0x04 */
   /* #  define SWRST_ 0x02 */
   /* #  define SWRST_ 0x01 */
/* #define RESERVED_0x014f 0x014f */
#define MPADR 0x0150
#  define MPADR_PADDR_MASK 0x1f
#define MRADR 0x0151
#  define MRADR_RADDR_MASK 0x1f
#define MWDATA 0x0152
#define MWDATAHI 0x0152
#define MWDATALO 0x0153
#define MRDATA 0x0154
#define MRDATAHI 0x0154
#define MRDATALO 0x0155
#define MCMST 0x0156
#  define MCMST_OP1 0x80
#  define MCMST_OP0 0x40
#  define MCMST_BUSY 0x20
#  define MCMST_NOPRE 0x10
#  define MCMST_MDCSEL3 0x08
#  define MCMST_MDCSEL2 0x04
#  define MCMST_MDCSEL1 0x02
#  define MCMST_MDCSEL0 0x01
#  define MCMST_MDCSEL_MASK 0x0f
/* #define RESERVED_0x0157 0x0157 */
#define BUFCFG 0x0158
#  define BUFCFG_BUFMAP_MASK 0x7000
#  define BUFCFG_MAXFL_MASK  0x07ff
#define BUFCFGHI 0x0158
#  define BUFCFGHI_BUFMAP_MASK 0x70
#  define BUFCFGHI_MAXFL_MASK  0x07
#define BUFCFGLO 0x0159
#  define BUFCFGLO_MAXFL_MASK 0xff
#define RXAEFP 0x015a
#  define RXAEFP_MASK 0x07ff
#define RXAEFPHI 0x015a
#define RXAEFPLO 0x015b
#define RXBEFP 0x015c
#  define RXBEFP_MASK 0x07ff
#define RXBEFPHI 0x015c
#define RXBEFPLO 0x015d
#define TXEFP 0x015e
#  define TXEFP_MASK 0x07ff
#define TXEFPHI 0x015e
#define TXEFPLO 0x015f
#define MCHASH 0x0160 /* 0x0160..0x0167 */
#define MACAD  0x0168 /* 0x0168..0x016d */
#define EMISC 0x016e
#  define EMISC_INDEX_MASK 0xe000
#  define EMISC_MISC_MASK  0x07ff
#define EMISCHI 0x016e
#  define EMISCHI_INDEX_MASK 0xe0
#  define EMISCHI_MISC_MASK  0x07
#define EMISCLO 0x016f
#  define EMISCLO_MISC_MASK  0xff

/* reserved: 0x0170..0x23f */

