george-hopkins/hcs12mem/target/io_mc9s12ne64.h
/* PIM */

#define PTT 0x0240
#  define PTT_PTT7 0x80
#  define PTT_PTT6 0x40
#  define PTT_PTT5 0x20
#  define PTT_PTT4 0x10
   /* #  define PTT_ 0x08 */
   /* #  define PTT_ 0x04 */
   /* #  define PTT_ 0x02 */
   /* #  define PTT_ 0x01 */
#define PTIT 0x0241
#  define PTIT_PTIT7 0x80
#  define PTIT_PTIT6 0x40
#  define PTIT_PTIT5 0x20
#  define PTIT_PTIT4 0x10
   /* #  define PTIT_ 0x08 */
   /* #  define PTIT_ 0x04 */
   /* #  define PTIT_ 0x02 */
   /* #  define PTIT_ 0x01 */
#define DDRT 0x0242
#  define DDRT_DDRT7 0x80
#  define DDRT_DDRT6 0x40
#  define DDRT_DDRT5 0x20
#  define DDRT_DDRT4 0x10
   /* #  define DDRT_ 0x08 */
   /* #  define DDRT_ 0x04 */
   /* #  define DDRT_ 0x02 */
   /* #  define DDRT_ 0x01 */
#define RDRT 0x0243
#  define RDRT_RDRT7 0x80
#  define RDRT_RDRT6 0x40
#  define RDRT_RDRT5 0x20
#  define RDRT_RDRT4 0x10
   /* #  define RDRT_ 0x08 */
   /* #  define RDRT_ 0x04 */
   /* #  define RDRT_ 0x02 */
   /* #  define RDRT_ 0x01 */
#define PERT 0x0244
#  define PERT_PERT7 0x80
#  define PERT_PERT6 0x40
#  define PERT_PERT5 0x20
#  define PERT_PERT4 0x10
   /* #  define PERT_ 0x08 */
   /* #  define PERT_ 0x04 */
   /* #  define PERT_ 0x02 */
   /* #  define PERT_ 0x01 */
#define PPST 0x0245
#  define PPST_PPST7 0x80
#  define PPST_PPST6 0x40
#  define PPST_PPST5 0x20
#  define PPST_PPST4 0x10
   /* #  define PPST_ 0x08 */
   /* #  define PPST_ 0x04 */
   /* #  define PPST_ 0x02 */
   /* #  define PPST_ 0x01 */
/* #define RESERVED_0x0246 0x0246 */
/* #define RESERVED_0x0247 0x0247 */
#define PTS 0x0248
#  define PTS_PTS7 0x80
#  define PTS_PTS6 0x40
#  define PTS_PTS5 0x20
#  define PTS_PTS4 0x10
#  define PTS_PTS3 0x08
#  define PTS_PTS2 0x04
#  define PTS_PTS1 0x02
#  define PTS_PTS0 0x01
#define PTIS 0x0249
#  define PTIS_PTIS7 0x80
#  define PTIS_PTIS6 0x40
#  define PTIS_PTIS5 0x20
#  define PTIS_PTIS4 0x10
#  define PTIS_PTIS3 0x08
#  define PTIS_PTIS2 0x04
#  define PTIS_PTIS1 0x02
#  define PTIS_PTIS0 0x01
#define DDRS 0x024a
#  define DDRS_DDRS7 0x80
#  define DDRS_DDRS6 0x40
#  define DDRS_DDRS5 0x20
#  define DDRS_DDRS4 0x10
#  define DDRS_DDRS3 0x08
#  define DDRS_DDRS2 0x04
#  define DDRS_DDRS1 0x02
#  define DDRS_DDRS0 0x01
#define RDRS 0x024b
#  define RDRS_RDRS7 0x80
#  define RDRS_RDRS6 0x40
#  define RDRS_RDRS5 0x20
#  define RDRS_RDRS4 0x10
#  define RDRS_RDRS3 0x08
#  define RDRS_RDRS2 0x04
#  define RDRS_RDRS1 0x02
#  define RDRS_RDRS0 0x01
#define PERS 0x024c
#  define PERS_PERS7 0x80
#  define PERS_PERS6 0x40
#  define PERS_PERS5 0x20
#  define PERS_PERS4 0x10
#  define PERS_PERS3 0x08
#  define PERS_PERS2 0x04
#  define PERS_PERS1 0x02
#  define PERS_PERS0 0x01
#define PPSS 0x024d
#  define PPSS_PPSS7 0x80
#  define PPSS_PPSS6 0x40
#  define PPSS_PPSS5 0x20
#  define PPSS_PPSS4 0x10
#  define PPSS_PPSS3 0x08
#  define PPSS_PPSS2 0x04
#  define PPSS_PPSS1 0x02
#  define PPSS_PPSS0 0x01
#define WOMS 0x024e
#  define WOMS_WOMS7 0x80
#  define WOMS_WOMS6 0x40
#  define WOMS_WOMS5 0x20
#  define WOMS_WOMS4 0x10
#  define WOMS_WOMS3 0x08
#  define WOMS_WOMS2 0x04
#  define WOMS_WOMS1 0x02
#  define WOMS_WOMS0 0x01
/* #define RESERVED_0x024f 0x024f */
#define PTG 0x0250
#  define PTG_PTG7 0x80
#  define PTG_PTG6 0x40
#  define PTG_PTG5 0x20
#  define PTG_PTG4 0x10
#  define PTG_PTG3 0x08
#  define PTG_PTG2 0x04
#  define PTG_PTG1 0x02
#  define PTG_PTG0 0x01
#define PTIG 0x0251
#  define PTIG_PTIG7 0x80
#  define PTIG_PTIG6 0x40
#  define PTIG_PTIG5 0x20
#  define PTIG_PTIG4 0x10
#  define PTIG_PTIG3 0x08
#  define PTIG_PTIG2 0x04
#  define PTIG_PTIG1 0x02
#  define PTIG_PTIG0 0x01
#define DDRG 0x0252
#  define DDRG_DDRG7 0x80
#  define DDRG_DDRG6 0x40
#  define DDRG_DDRG5 0x20
#  define DDRG_DDRG4 0x10
#  define DDRG_DDRG3 0x08
#  define DDRG_DDRG2 0x04
#  define DDRG_DDRG1 0x02
#  define DDRG_DDRG0 0x01
#define RDRG 0x0253
#  define RDRG_RDRG7 0x80
#  define RDRG_RDRG6 0x40
#  define RDRG_RDRG5 0x20
#  define RDRG_RDRG4 0x10
#  define RDRG_RDRG3 0x08
#  define RDRG_RDRG2 0x04
#  define RDRG_RDRG1 0x02
#  define RDRG_RDRG0 0x01
#define PERG 0x0254
#  define PERG_PERG7 0x80
#  define PERG_PERG6 0x40
#  define PERG_PERG5 0x20
#  define PERG_PERG4 0x10
#  define PERG_PERG3 0x08
#  define PERG_PERG2 0x04
#  define PERG_PERG1 0x02
#  define PERG_PERG0 0x01
#define PPSG 0x0255
#  define PPSG_PPSG7 0x80
#  define PPSG_PPSG6 0x40
#  define PPSG_PPSG5 0x20
#  define PPSG_PPSG4 0x10
#  define PPSG_PPSG3 0x08
#  define PPSG_PPSG2 0x04
#  define PPSG_PPSG1 0x02
#  define PPSG_PPSG0 0x01
#define PIEG 0x0256
#  define PIEG_PIEG7 0x80
#  define PIEG_PIEG6 0x40
#  define PIEG_PIEG5 0x20
#  define PIEG_PIEG4 0x10
#  define PIEG_PIEG3 0x08
#  define PIEG_PIEG2 0x04
#  define PIEG_PIEG1 0x02
#  define PIEG_PIEG0 0x01
#define PIFG 0x0257
#  define PIFG_PIFG7 0x80
#  define PIFG_PIFG6 0x40
#  define PIFG_PIFG5 0x20
#  define PIFG_PIFG4 0x10
#  define PIFG_PIFG3 0x08
#  define PIFG_PIFG2 0x04
#  define PIFG_PIFG1 0x02
#  define PIFG_PIFG0 0x01
#define PTH 0x0258
   /* #  define PTH_ 0x80 */
#  define PTH_PTH6 0x40
#  define PTH_PTH5 0x20
#  define PTH_PTH4 0x10
#  define PTH_PTH3 0x08
#  define PTH_PTH2 0x04
#  define PTH_PTH1 0x02
#  define PTH_PTH0 0x01
#define PTIH 0x0259
   /* #  define PTIH_ 0x80 */
#  define PTIH_PTIH6 0x40
#  define PTIH_PTIH5 0x20
#  define PTIH_PTIH4 0x10
#  define PTIH_PTIH3 0x08
#  define PTIH_PTIH2 0x04
#  define PTIH_PTIH1 0x02
#  define PTIH_PTIH0 0x01
#define DDRH 0x025a
   /* #  define DDRH_ 0x80 */
#  define DDRH_DDRH6 0x40
#  define DDRH_DDRH5 0x20
#  define DDRH_DDRH4 0x10
#  define DDRH_DDRH3 0x08
#  define DDRH_DDRH2 0x04
#  define DDRH_DDRH1 0x02
#  define DDRH_DDRH0 0x01
#define RDRH 0x025b
   /* #  define RDRH_ 0x80 */
#  define RDRH_RDRH6 0x40
#  define RDRH_RDRH5 0x20
#  define RDRH_RDRH4 0x10
#  define RDRH_RDRH3 0x08
#  define RDRH_RDRH2 0x04
#  define RDRH_RDRH1 0x02
#  define RDRH_RDRH0 0x01
#define PERH 0x025c
   /* #  define PERH_ 0x80 */
#  define PERH_PERH6 0x40
#  define PERH_PERH5 0x20
#  define PERH_PERH4 0x10
#  define PERH_PERH3 0x08
#  define PERH_PERH2 0x04
#  define PERH_PERH1 0x02
#  define PERH_PERH0 0x01
#define PPSH 0x025d
   /* #  define PPSH_ 0x80 */
#  define PPSH_PPSH6 0x40
#  define PPSH_PPSH5 0x20
#  define PPSH_PPSH4 0x10
#  define PPSH_PPSH3 0x08
#  define PPSH_PPSH2 0x04
#  define PPSH_PPSH1 0x02
#  define PPSH_PPSH0 0x01
#define PIEH 0x025e
   /* #  define PIEH_ 0x80 */
#  define PIEH_PIEH6 0x40
#  define PIEH_PIEH5 0x20
#  define PIEH_PIEH4 0x10
#  define PIEH_PIEH3 0x08
#  define PIEH_PIEH2 0x04
#  define PIEH_PIEH1 0x02
#  define PIEH_PIEH0 0x01
#define PIFH 0x025f
   /* #  define PIFH_ 0x80 */
#  define PIFH_PIFH6 0x40
#  define PIFH_PIFH5 0x20
#  define PIFH_PIFH4 0x10
#  define PIFH_PIFH3 0x08
#  define PIFH_PIFH2 0x04
#  define PIFH_PIFH1 0x02
#  define PIFH_PIFH0 0x01
#define PTJ 0x0260
#  define PTJ_PTJ7 0x80
#  define PTJ_PTJ6 0x40
   /* #  define PTJ_ 0x20 */
   /* #  define PTJ_ 0x10 */
#  define PTJ_PTJ3 0x08
#  define PTJ_PTJ2 0x04
#  define PTJ_PTJ1 0x02
#  define PTJ_PTJ0 0x01
#define PTIJ 0x0261
#  define PTIJ_PTIJ7 0x80
#  define PTIJ_PTIJ6 0x40
   /* #  define PTIJ_ 0x20 */
   /* #  define PTIJ_ 0x10 */
#  define PTIJ_PTIJ3 0x08
#  define PTIJ_PTIJ2 0x04
#  define PTIJ_PTIJ1 0x02
#  define PTIJ_PTIJ0 0x01
#define DDRJ 0x0262
#  define DDRJ_DDRJ7 0x80
#  define DDRJ_DDRJ6 0x40
   /* #  define DDRJ_ 0x20 */
   /* #  define DDRJ_ 0x10 */
#  define DDRJ_DDRJ3 0x08
#  define DDRJ_DDRJ2 0x04
#  define DDRJ_DDRJ1 0x02
#  define DDRJ_DDRJ0 0x01
#define RDRJ 0x0263
#  define RDRJ_RDRJ7 0x80
#  define RDRJ_RDRJ6 0x40
   /* #  define RDRJ_ 0x20 */
   /* #  define RDRJ_ 0x10 */
#  define RDRJ_RDRJ3 0x08
#  define RDRJ_RDRJ2 0x04
#  define RDRJ_RDRJ1 0x02
#  define RDRJ_RDRJ0 0x01
#define PERJ 0x0264
#  define PERJ_PERJ7 0x80
#  define PERJ_PERJ6 0x40
   /* #  define PERJ_ 0x20 */
   /* #  define PERJ_ 0x10 */
#  define PERJ_PERJ3 0x08
#  define PERJ_PERJ2 0x04
#  define PERJ_PERJ1 0x02
#  define PERJ_PERJ0 0x01
#define PPSJ 0x0265
#  define PPSJ_PPSJ7 0x80
#  define PPSJ_PPSJ6 0x40
   /* #  define PPSJ_ 0x20 */
   /* #  define PPSJ_ 0x10 */
#  define PPSJ_PPSJ3 0x08
#  define PPSJ_PPSJ2 0x04
#  define PPSJ_PPSJ1 0x02
#  define PPSJ_PPSJ0 0x01
#define PIEJ 0x0266
#  define PIEJ_PIEJ7 0x80
#  define PIEJ_PIEJ6 0x40
   /* #  define PIEJ_ 0x20 */
   /* #  define PIEJ_ 0x10 */
#  define PIEJ_PIEJ3 0x08
#  define PIEJ_PIEJ2 0x04
#  define PIEJ_PIEJ1 0x02
#  define PIEJ_PIEJ0 0x01
#define PIFJ 0x0267
#  define PIFJ_PIFJ7 0x80
#  define PIFJ_PIFJ6 0x40
   /* #  define PIFJ_ 0x20 */
   /* #  define PIFJ_ 0x10 */
#  define PIFJ_PIFJ3 0x08
#  define PIFJ_PIFJ2 0x04
#  define PIFJ_PIFJ1 0x02
#  define PIFJ_PIFJ0 0x01
#define PTL 0x0268
   /* #  define PTL_ 0x80 */
#  define PTL_PTL6 0x40
#  define PTL_PTL5 0x20
#  define PTL_PTL4 0x10
#  define PTL_PTL3 0x08
#  define PTL_PTL2 0x04
#  define PTL_PTL1 0x02
#  define PTL_PTL0 0x01
#define PTIL 0x0269
   /* #  define PTIL_ 0x80 */
#  define PTIL_PTIL6 0x40
#  define PTIL_PTIL5 0x20
#  define PTIL_PTIL4 0x10
#  define PTIL_PTIL3 0x08
#  define PTIL_PTIL2 0x04
#  define PTIL_PTIL1 0x02
#  define PTIL_PTIL0 0x01
#define DDRL 0x026a
   /* #  define DDRL_ 0x80 */
#  define DDRL_DDRL6 0x40
#  define DDRL_DDRL5 0x20
#  define DDRL_DDRL4 0x10
#  define DDRL_DDRL3 0x08
#  define DDRL_DDRL2 0x04
#  define DDRL_DDRL1 0x02
#  define DDRL_DDRL0 0x01
#define RDRL 0x026b
   /* #  define RDRL_ 0x80 */
#  define RDRL_RDRL6 0x40
#  define RDRL_RDRL5 0x20
#  define RDRL_RDRL4 0x10
#  define RDRL_RDRL3 0x08
#  define RDRL_RDRL2 0x04
#  define RDRL_RDRL1 0x02
#  define RDRL_RDRL0 0x01
#define PERL 0x026c
   /* #  define PERL_ 0x80 */
#  define PERL_PERL6 0x40
#  define PERL_PERL5 0x20
#  define PERL_PERL4 0x10
#  define PERL_PERL3 0x08
#  define PERL_PERL2 0x04
#  define PERL_PERL1 0x02
#  define PERL_PERL0 0x01
#define PPSL 0x026d
   /* #  define PPSL_ 0x80 */
#  define PPSL_PPSL6 0x40
#  define PPSL_PPSL5 0x20
#  define PPSL_PPSL4 0x10
#  define PPSL_PPSL3 0x08
#  define PPSL_PPSL2 0x04
#  define PPSL_PPSL1 0x02
#  define PPSL_PPSL0 0x01
#define WOML 0x026e
   /* #  define WOML_ 0x80 */
#  define WOML_WOML6 0x40
#  define WOML_WOML5 0x20
#  define WOML_WOML4 0x10
#  define WOML_WOML3 0x08
#  define WOML_WOML2 0x04
#  define WOML_WOML1 0x02
#  define WOML_WOML0 0x01
/* #define RESERVED_0x026f 0x026f */

/* reserved: 0x0270..0x03ff */

#endif /* __IO_MC9S12NE64_H */
